{"template":"__react_static_root__/src/pages/blog/post.js","sharedHashesByProp":{},"data":{"post":{"metadata":{"slug":"2020-05-14-github-ssh","title":"Having multiple SSH keys for different GitHub accounts","date":"2020-05-14T00:00:00.000Z","lang":"en"},"body":"\n## Context\n\nThe company I work for stores its source code inside private Github repositories. To access those repositories, I chose to use a GitHub account that's separate from my personal GitHub account. However, I still want to have access to some of my personal repositories from my work machine (mainly, my dotfiles and my personal notes).  \nThis is why explored solutions that would allow me, to use different keys to access GitHub trough SSH, depending on the repository.\n\n## Setup\n\nFirst, some notes about my setup:\n\n- both keys are stored in `~/.ssh/` folder, and are encrypted using passphrases\n- my work key is `id_rsa` and my personal key is `id_rsa_personal`\n\nThe desired behavior is:\n\n- use my personal key when pulling from / pushing to my personal repositories\n- use my work key in all other contexts\n\n## First try\n\nThe first version of my `~/.ssh/config` file was:\n\n```\nHost github-personal\n    User git\n    HostName github.com\n    IdentityFile ~/.ssh/id_rsa_personal\n\nHost *\n    IdentityFile ~/.ssh/id_rsa\n    AddKeysToAgent yes\n    UseKeychain yes\n```\n\nThe idea was that I would be able to access my personal repositories by cloning them using `git clone github-personal:puigfp/repo.git`, and access my work repositories by cloning them using `git clone git@github.com:work/repo.git`.\n\n## Issues\n\nUnfortunately, I discovered two behaviors of the SSH client that made this config file not work as I intended it to.\n\n### First behavior\n\nThe first behavior is that, by default, the SSH client doesn't only try to authenticate using the key(s) specified in your config, but also with the other keys loaded in your SSH agent.\n\nFor instance, if my work key is loaded in my SSH agent and I run `git clone github-personal:puigfp/repo.git`, the SSH client may try to authenticate using my work key before trying with my personal key.\n\nWhen it happens, the authentication succeeds, because my work key is known by GitHub (as it's associated with my work account), but the clone fails with:\n\n```\nERROR: Repository not found.\nfatal: Could not read from remote repository.\n\nPlease make sure you have the correct access rights\nand the repository exists.\n```\n\nThe configuration option for preventing this behavior is `IdentitiesOnly`. The [ssh_config man page](https://linux.die.net/man/5/ssh_config) reads:\n\n> IdentitiesOnly\n>\n> Specifies that ssh(1) should only use the authentication identity files configured in the ssh_config files, even if ssh-agent(1) offers more identities. The argument to this keyword must be ''yes'' or ''no''. This option is intended for situations where ssh-agent offers many different identities. The default is ''no''.\n\nTherefore, I added the following lines at the end of my config:\n\n```\nHost *\n    IdentitiesOnly yes\n```\n\n### Second behavior\n\nAfter adding those lines, I repeated the `git clone` experiment and... got the same error message.\n\nAfter a some googling, I found out that the `IdentityFile` option didn't behave as I thought it did.\n\nThe [ssh_config man page](https://linux.die.net/man/5/ssh_config) reads:\n\n> For each parameter, the first obtained value will be used.\n\nIt turns out that this isn't true for all parameters. The section about the `IdentityFile` parameter reads:\n\n> It is possible to have multiple identity files specified in configuration files; all these identities will be tried in sequence.\n\nWhen I try to access `github-personal` using SSH, both the `Host github-personal` sections and `Host *` section are read sequentially and taken into account. Therefore, my config actually tells the SSH client that both my work key and my personal key can be used to authenticate.\n\nThe fix is to move the `IdentityFile ~/.ssh/id_rsa` statement under a separate section, with a stricter filter:\n\n```\nHost * !github-personal\n    IdentityFile ~/.ssh/id_rsa\n```\n\n## Wrapping up\n\nA working SSH config for my use-case is:\n\n```\nHost github-personal\n    User git\n    HostName github.com\n    IdentityFile ~/.ssh/id_rsa_personal\n\nHost * !github-personal\n    IdentityFile ~/.ssh/id_rsa\n\nHost *\n    AddKeysToAgent yes\n    UseKeychain yes\n    IdentitiesOnly yes\n```\n"}},"path":"blog/post/2020-05-14-github-ssh"}
